src/cfe/МенеджерСинхронизаций/Enums/МС_ТипИсточникаКонструктораAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МС_ТипИсточникаКонструктораAPI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Enums/МС_СпособСопоставленияПараметраОтбора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МС_СпособСопоставленияПараметраОтбора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Авто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Идентификатор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наименование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/CommonModules/МС_HTTPAPIКонструкторСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Строит полное имя таблицы запроса по полям мастера.
//
Функция ПолноеИмяТаблицыЗапроса(ТипИсточника, ИмяОбъекта, ИмяТабличнойЧасти) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяОбъекта) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипИсточника = Перечисления.МС_ТипИсточникаКонструктораAPI.Справочник Тогда
		База = "Справочник." + ИмяОбъекта;
	ИначеЕсли ТипИсточника = Перечисления.МС_ТипИсточникаКонструктораAPI.Документ Тогда
		База = "Документ." + ИмяОбъекта;
	ИначеЕсли ТипИсточника = Перечисления.МС_ТипИсточникаКонструктораAPI.РегистрСведений Тогда
		Возврат "РегистрСведений." + ИмяОбъекта;
	ИначеЕсли ТипИсточника = Перечисления.МС_ТипИсточникаКонструктораAPI.ПланВидовХарактеристик Тогда
		Возврат "ПланВидовХарактеристик." + ИмяОбъекта;
	Иначе
		Возврат "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
		Возврат База + ".ТабличнаяЧасть." + ИмяТабличнойЧасти;
	Иначе
		Возврат База;
	КонецЕсли;
	
КонецФункции

// Разбор сохранённого полного имени таблицы в поля мастера (для старых записей и ручного ввода).
//
Функция РазобратьПолноеИмяТаблицыВМастер(Знач ПолноеИмя) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ТипИсточника", Неопределено);
	Результат.Вставить("ИмяОбъекта", "");
	Результат.Вставить("ИмяТабличнойЧасти", "");
	
	Если Не ЗначениеЗаполнено(ПолноеИмя) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Части = СтрРазделить(ПолноеИмя, ".");
	Если Части.Количество() < 2 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Вид = СокрЛП(Части[0]);
	Если ВРег(Вид) = ВРег("Справочник") Тогда
		Результат.ТипИсточника = Перечисления.МС_ТипИсточникаКонструктораAPI.Справочник;
	ИначеЕсли ВРег(Вид) = ВРег("Документ") Тогда
		Результат.ТипИсточника = Перечисления.МС_ТипИсточникаКонструктораAPI.Документ;
	ИначеЕсли ВРег(Вид) = ВРег("РегистрСведений") Тогда
		Результат.ТипИсточника = Перечисления.МС_ТипИсточникаКонструктораAPI.РегистрСведений;
		Результат.ИмяОбъекта = СокрЛП(Части[1]);
		Возврат Результат;
	ИначеЕсли ВРег(Вид) = ВРег("ПланВидовХарактеристик") Тогда
		Результат.ТипИсточника = Перечисления.МС_ТипИсточникаКонструктораAPI.ПланВидовХарактеристик;
		Результат.ИмяОбъекта = СокрЛП(Части[1]);
		Возврат Результат;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
	Результат.ИмяОбъекта = СокрЛП(Части[1]);
	Если Части.Количество() >= 4 И ВРег(СокрЛП(Части[2])) = ВРег("ТабличнаяЧасть") Тогда
		Результат.ИмяТабличнойЧасти = СокрЛП(Части[3]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Список имён объектов метаданных для выбора (значение - имя, представление - синоним).
//
Функция СписокОбъектовПоТипу(ТипИсточника) Экспорт
	
	Массив = Новый Массив;
	
	Если ТипИсточника = Перечисления.МС_ТипИсточникаКонструктораAPI.Справочник Тогда
		Для Каждого Мета Из Метаданные.Справочники Цикл
			ДобавитьЭлементСпискаОбъектов(Массив, Мета);
		КонецЦикла;
	ИначеЕсли ТипИсточника = Перечисления.МС_ТипИсточникаКонструктораAPI.Документ Тогда
		Для Каждого Мета Из Метаданные.Документы Цикл
			ДобавитьЭлементСпискаОбъектов(Массив, Мета);
		КонецЦикла;
	ИначеЕсли ТипИсточника = Перечисления.МС_ТипИсточникаКонструктораAPI.РегистрСведений Тогда
		Для Каждого Мета Из Метаданные.РегистрыСведений Цикл
			ДобавитьЭлементСпискаОбъектов(Массив, Мета);
		КонецЦикла;
	ИначеЕсли ТипИсточника = Перечисления.МС_ТипИсточникаКонструктораAPI.ПланВидовХарактеристик Тогда
		Для Каждого Мета Из Метаданные.ПланыВидовХарактеристик Цикл
			ДобавитьЭлементСпискаОбъектов(Массив, Мета);
		КонецЦикла;
	КонецЕсли;
	
	СортироватьМассивСтруктурПоПредставлению(Массив);
	Возврат Массив;
	
КонецФункции

// Имена табличных частей объекта (для справочника или документа).
//
Функция СписокТабличныхЧастей(ТипИсточника, ИмяОбъекта) Экспорт
	
	Результат = Новый Массив;
	Если Не ЗначениеЗаполнено(ИмяОбъекта) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Родитель = Неопределено;
	Если ТипИсточника = Перечисления.МС_ТипИсточникаКонструктораAPI.Справочник Тогда
		Родитель = Метаданные.Справочники.Найти(ИмяОбъекта);
	ИначеЕсли ТипИсточника = Перечисления.МС_ТипИсточникаКонструктораAPI.Документ Тогда
		Родитель = Метаданные.Документы.Найти(ИмяОбъекта);
	Иначе
		Возврат Результат;
	КонецЕсли;
	
	Если Родитель = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ТЧ Из Родитель.ТабличныеЧасти Цикл
		Стр = Новый Структура;
		Стр.Вставить("Имя", ТЧ.Имя);
		Стр.Вставить("Представление", ТЧ.Представление());
		Результат.Добавить(Стр);
	КонецЦикла;
	
	СортироватьМассивСтруктурПоПредставлению(Результат);
	Возврат Результат;
	
КонецФункции

// Заполняет таблицу полей по метаданным выбранной таблицы запроса.
//
Процедура ЗаполнитьТаблицуПолейПоМетаданным(ПолноеИмяТаблицы, ТаблицаПолей, СохранитьФлагиВключения) Экспорт
	
	СтароеВключение = Новый Соответствие;
	Если СохранитьФлагиВключения Тогда
		Для Каждого Стр Из ТаблицаПолей Цикл
			СтароеВключение.Вставить(Стр.ИмяПоля, Стр.Включить);
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаПолей.Очистить();
	
	Если Не ЗначениеЗаполнено(ПолноеИмяТаблицы) Тогда
		Возврат;
	КонецЕсли;
	
	Описание = ОписаниеМетаданныхДляПолей(ПолноеИмяТаблицы);
	Если Описание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Поле Из Описание.Поля Цикл
		НоваяСтрока = ТаблицаПолей.Добавить();
		НоваяСтрока.ИмяПоля = Поле.Имя;
		НоваяСтрока.Представление = Поле.Представление;
		Если СохранитьФлагиВключения И СтароеВключение.Получить(Поле.Имя) <> Неопределено Тогда
			НоваяСтрока.Включить = СтароеВключение.Получить(Поле.Имя);
		Иначе
			НоваяСтрока.Включить = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет список выбора колонки «Поле» в отборах: имена реквизитов таблицы источника
// (те же, что попадают в запрос как Т.ИмяПоля). ДополнительныеИмена - для сохранения
// уже введённых значений, если их нет в метаданных (старые настройки).
//
Процедура ЗаполнитьСписокВыбораПолейОтбора(ПолноеИмяТаблицы, СписокВыбора, ДополнительныеИмена) Экспорт
	
	СписокВыбора.Очистить();
	УжеЕсть = Новый Соответствие;
	
	Если ЗначениеЗаполнено(ПолноеИмяТаблицы) Тогда
		Описание = ОписаниеМетаданныхДляПолей(ПолноеИмяТаблицы);
		Если Описание <> Неопределено Тогда
			Для Каждого Поле Из Описание.Поля Цикл
				СписокВыбора.Добавить(Поле.Имя, Поле.Представление);
				УжеЕсть.Вставить(Поле.Имя, Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеИмена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Имя Из ДополнительныеИмена Цикл
		ИмяС = СокрЛП(Строка(Имя));
		Если Не ЗначениеЗаполнено(ИмяС) Тогда
			Продолжить;
		КонецЕсли;
		Если УжеЕсть.Получить(ИмяС) = Неопределено Тогда
			СписокВыбора.Добавить(ИмяС, ИмяС);
			УжеЕсть.Вставить(ИмяС, Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Загружает таблицы формы из реквизитов объекта (JSON и мастер).
//
Процедура ЗагрузитьКонструкторВТаблицыФормы(ОбъектНастройки, ПоляКонструктора, ОтборыКонструктора) Экспорт
	
	ПоляКонструктора.Очистить();
	ОтборыКонструктора.Очистить();
	
	Если Не ЗначениеЗаполнено(ОбъектНастройки.КонструкторТипИсточника)
		И ЗначениеЗаполнено(ОбъектНастройки.КонструкторИмяТаблицы) Тогда
		Разобрано = РазобратьПолноеИмяТаблицыВМастер(ОбъектНастройки.КонструкторИмяТаблицы);
		Если Разобрано.ТипИсточника <> Неопределено Тогда
			ОбъектНастройки.КонструкторТипИсточника = Разобрано.ТипИсточника;
			ОбъектНастройки.КонструкторИмяОбъекта = Разобрано.ИмяОбъекта;
			ОбъектНастройки.КонструкторИмяТабличнойЧасти = Разобрано.ИмяТабличнойЧасти;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектНастройки.КонструкторПоля) Тогда
		Попытка
			Прочитанное = JSONВЗначение(ОбъектНастройки.КонструкторПоля);
			Если ТипЗнч(Прочитанное) = Тип("Массив") Тогда
				Для Каждого Эл Из Прочитанное Цикл
					НоваяСтрока = ПоляКонструктора.Добавить();
					НоваяСтрока.ИмяПоля = Строка(Эл);
					НоваяСтрока.Представление = НоваяСтрока.ИмяПоля;
					НоваяСтрока.Включить = Истина;
				КонецЦикла;
			КонецЕсли;
		Исключение
			Части = СтрРазделить(ОбъектНастройки.КонструкторПоля, ",", Ложь);
			Для Каждого Часть Из Части Цикл
				Имя = СокрЛП(Часть);
				Если ЗначениеЗаполнено(Имя) Тогда
					НоваяСтрока = ПоляКонструктора.Добавить();
					НоваяСтрока.ИмяПоля = Имя;
					НоваяСтрока.Представление = Имя;
					НоваяСтрока.Включить = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецПопытки;
	КонецЕсли;
	
	ПолноеИмяДляОтборов = ПолноеИмяТаблицыЗапроса(ОбъектНастройки.КонструкторТипИсточника, ОбъектНастройки.КонструкторИмяОбъекта, ОбъектНастройки.КонструкторИмяТабличнойЧасти);
	Если Не ЗначениеЗаполнено(ПолноеИмяДляОтборов) И ЗначениеЗаполнено(ОбъектНастройки.КонструкторИмяТаблицы) Тогда
		ПолноеИмяДляОтборов = СокрЛП(ОбъектНастройки.КонструкторИмяТаблицы);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектНастройки.КонструкторОтборыJSON) Тогда
		Попытка
			Отборы = JSONВЗначение(ОбъектНастройки.КонструкторОтборыJSON);
			Если ТипЗнч(Отборы) = Тип("Массив") Тогда
				Для Каждого ЭлементОтбора Из Отборы Цикл
					Если ТипЗнч(ЭлементОтбора) <> Тип("Соответствие") И ТипЗнч(ЭлементОтбора) <> Тип("Структура") Тогда
						Продолжить;
					КонецЕсли;
					НоваяСтрока = ОтборыКонструктора.Добавить();
					НоваяСтрока.Поле = Строка(ЗначениеКлючаСтруктуры(ЭлементОтбора, "Поле"));
					НоваяСтрока.Сравнение = Строка(ЗначениеКлючаСтруктуры(ЭлементОтбора, "Сравнение"));
					Если Не ЗначениеЗаполнено(НоваяСтрока.Сравнение) Тогда
						НоваяСтрока.Сравнение = "=";
					КонецЕсли;
					НоваяСтрока.ИмяПараметра = Строка(ЗначениеКлючаСтруктуры(ЭлементОтбора, "ИмяПараметра"));
					ЗначениеВнутр = ЗначениеКлючаСтруктуры(ЭлементОтбора, "ЗначениеВнутр");
					Если ЗначениеВнутр <> Неопределено И ЗначениеЗаполнено(Строка(ЗначениеВнутр)) Тогда
						Попытка
							НоваяСтрока.ЗначениеКонстанты = ПредставлениеЗначенияДляСтрокиОтбора(ЗначениеИзСтрокиВнутр(Строка(ЗначениеВнутр)));
						Исключение
							НоваяСтрока.ЗначениеКонстанты = "";
						КонецПопытки;
					Иначе
						Зн = ЗначениеКлючаСтруктуры(ЭлементОтбора, "Значение");
						Если Зн <> Неопределено Тогда
							Если ТипЗнч(Зн) = Тип("Строка") Тогда
								ОТ = ПолучитьОписаниеТипаПоляТаблицы(ПолноеИмяДляОтборов, НоваяСтрока.Поле);
								ЗнТип = ЗначениеИзСтрокиПоОписаниюТипов(ОТ, Строка(Зн));
								НоваяСтрока.ЗначениеКонстанты = ПредставлениеЗначенияДляСтрокиОтбора(ЗнТип);
							Иначе
								НоваяСтрока.ЗначениеКонстанты = ПредставлениеЗначенияДляСтрокиОтбора(Зн);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ПолноеИмя = ПолноеИмяТаблицыЗапроса(ОбъектНастройки.КонструкторТипИсточника, ОбъектНастройки.КонструкторИмяОбъекта, ОбъектНастройки.КонструкторИмяТабличнойЧасти);
	Если ПоляКонструктора.Количество() = 0 И ЗначениеЗаполнено(ПолноеИмя) Тогда
		ЗаполнитьТаблицуПолейПоМетаданным(ПолноеИмя, ПоляКонструктора, Ложь);
	ИначеЕсли ПоляКонструктора.Количество() > 0 И ЗначениеЗаполнено(ПолноеИмя) Тогда
		Подписи = СоответствиеПредставленийПолей(ПолноеИмя);
		Для Каждого Стр Из ПоляКонструктора Цикл
			Представление = Подписи.Получить(Стр.ИмяПоля);
			Если Представление <> Неопределено Тогда
				Стр.Представление = Представление;
			Иначе
				Стр.Представление = Стр.ИмяПоля;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Записывает в объект поля КонструкторИмяТаблицы, КонструкторПоля, КонструкторОтборыJSON из мастера и таблиц формы.
//
Процедура ПрименитьМастерКонструкторуКОбъекту(ОбъектНастройки, ПоляКонструктора, ОтборыКонструктора) Экспорт
	
	ПолноеИмя = ПолноеИмяТаблицыЗапроса(ОбъектНастройки.КонструкторТипИсточника, ОбъектНастройки.КонструкторИмяОбъекта, ОбъектНастройки.КонструкторИмяТабличнойЧасти);
	Если ЗначениеЗаполнено(ПолноеИмя) Тогда
		ОбъектНастройки.КонструкторИмяТаблицы = ПолноеИмя;
	КонецЕсли;
	
	МассивПолей = Новый Массив;
	Для Каждого Стр Из ПоляКонструктора Цикл
		Если Стр.Включить И ЗначениеЗаполнено(Стр.ИмяПоля) Тогда
			МассивПолей.Добавить(СокрЛП(Стр.ИмяПоля));
		КонецЕсли;
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивПолей);
	ОбъектНастройки.КонструкторПоля = ЗаписьJSON.Закрыть();
	
	МассивОтборов = Новый Массив;
	Для Каждого Стр Из ОтборыКонструктора Цикл
		Если Не ЗначениеЗаполнено(Стр.Поле) Тогда
			Продолжить;
		КонецЕсли;
		Эл = Новый Структура;
		Эл.Вставить("Поле", СокрЛП(Стр.Поле));
		Эл.Вставить("Сравнение", ?(ЗначениеЗаполнено(Стр.Сравнение), СокрЛП(Стр.Сравнение), "="));
		Если ЗначениеЗаполнено(Стр.ИмяПараметра) Тогда
			Эл.Вставить("ИмяПараметра", СокрЛП(Стр.ИмяПараметра));
		Иначе
			ЗначСтр = СокрЛП(Стр.ЗначениеКонстанты);
			Если Не ЗначениеЗаполнено(ЗначСтр) Тогда
				Продолжить;
			КонецЕсли;
			ОТ = ПолучитьОписаниеТипаПоляТаблицы(ПолноеИмя, Стр.Поле);
			ЗначТип = ЗначениеИзСтрокиПоОписаниюТипов(ОТ, ЗначСтр);
			Эл.Вставить("ЗначениеВнутр", ЗначениеВСтрокуВнутр(ЗначТип));
		КонецЕсли;
		МассивОтборов.Добавить(Эл);
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивОтборов);
	ОбъектНастройки.КонструкторОтборыJSON = ЗаписьJSON.Закрыть();
	
КонецПроцедуры

// Описание типов реквизита таблицы источника по полному имени таблицы и имени поля.
//
Функция ПолучитьОписаниеТипаПоляТаблицы(ПолноеИмяТаблицы, ИмяПоля) Экспорт
	
	Если Не ЗначениеЗаполнено(ПолноеИмяТаблицы) Или Не ЗначениеЗаполнено(ИмяПоля) Тогда
		Возврат Новый ОписаниеТипов;
	КонецЕсли;
	
	ОбъектМД = Метаданные.НайтиПоПолномуИмени(ПолноеИмяТаблицы);
	Если ОбъектМД <> Неопределено Тогда
		Возврат ОписаниеТипаПоляОбъектаМетаданных(ОбъектМД, ИмяПоля, Ложь);
	КонецЕсли;
	
	Части = СтрРазделить(ПолноеИмяТаблицы, ".");
	Если Части.Количество() = 4 И ВРег(СокрЛП(Части[2])) = ВРег("ТабличнаяЧасть") Тогда
		Родитель = Метаданные.НайтиПоПолномуИмени(Части[0] + "." + Части[1]);
		Если Родитель <> Неопределено Тогда
			ТЧ = Родитель.ТабличныеЧасти.Найти(СокрЛП(Части[3]));
			Если ТЧ <> Неопределено Тогда
				Возврат ОписаниеТипаПоляОбъектаМетаданных(ТЧ, ИмяПоля, Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый ОписаниеТипов;
	
КонецФункции

// Краткое имя типа для колонки «Тип» в параметрах API (тест и подсказка пользователю).
//
Функция КраткоеИмяТипаПараметраAPI(ОписаниеТипов) Экспорт
	
	Если ОписаниеТипов = Неопределено Или ОписаниеТипов.Типы().Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	Т0 = ОписаниеТипов.Типы()[0];
	Если Т0 = Тип("Строка") Тогда
		Возврат "СТРОКА";
	ИначеЕсли Т0 = Тип("Число") Тогда
		Возврат "ЧИСЛО";
	ИначеЕсли Т0 = Тип("Булево") Тогда
		Возврат "БУЛЕВО";
	ИначеЕсли Т0 = Тип("Дата") Тогда
		Возврат "ДАТА";
	ИначеЕсли Т0 = Тип("УникальныйИдентификатор") Тогда
		Возврат "УИД";
	ИначеЕсли ЭтоСсылочныйТипМетаданных(Т0) Тогда
		МетаТ = Метаданные.НайтиПоТипу(Т0);
		Если МетаТ <> Неопределено И СтрНачинаетсяС(МетаТ.ПолноеИмя(), "Перечисление.") Тогда
			Возврат "ПЕРЕЧИСЛЕНИЕ";
		КонецЕсли;
		Возврат "ССЫЛКА";
	Иначе
		Возврат "СТРОКА";
	КонецЕсли;
	
КонецФункции

// Значение по умолчанию для колонки «Сопоставление строки»: перечисления - по имени, иначе авто.
//
Функция СпособСопоставленияПараметраОтбораПоУмолчанию(ОписаниеТипов) Экспорт
	
	Если ОписаниеТипов = Неопределено Или ОписаниеТипов.Типы().Количество() = 0 Тогда
		Возврат Перечисления.МС_СпособСопоставленияПараметраОтбора.Авто;
	КонецЕсли;
	Мета = Метаданные.НайтиПоТипу(ОписаниеТипов.Типы()[0]);
	Если Мета <> Неопределено И СтрНачинаетсяС(Мета.ПолноеИмя(), "Перечисление.") Тогда
		Возврат Перечисления.МС_СпособСопоставленияПараметраОтбора.Наименование;
	КонецЕсли;
	Возврат Перечисления.МС_СпособСопоставленияПараметраОтбора.Авто;
	
КонецФункции

// Преобразует строку (в т.ч. UUID ссылки) к типу поля по метаданным.
//
Функция ЗначениеИзСтрокиПоОписаниюТипов(ОписаниеТипов, ЗначениеСтрока) Экспорт
	
	Возврат ЗначениеИзСтрокиПоОписаниюТиповИСпособу(ОписаниеТипов, ЗначениеСтрока, Неопределено);
	
КонецФункции

// Преобразует строку параметра API к типу поля; для ссылок учитывает способ (УИД, код, наименование).
//
Функция ЗначениеИзСтрокиПоОписаниюТиповИСпособу(ОписаниеТипов, ЗначениеСтрока, СпособСопоставления) Экспорт
	
	Если ЗначениеСтрока = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Стр = СокрЛП(Строка(ЗначениеСтрока));
	Если ОписаниеТипов = Неопределено Или ОписаниеТипов.Типы().Количество() = 0 Тогда
		Возврат Стр;
	КонецЕсли;
	Типы = ОписаниеТипов.Типы();
	Если Типы.Количество() = 1 Тогда
		Возврат ЗначениеИзСтрокиДляОдногоТипаССпособом(Типы[0], Стр, СпособСопоставления);
	КонецЕсли;
	Возврат ЗначениеИзСтрокиПоОписаниюТиповКомпозитный(ОписаниеТипов, Стр);
	
КонецФункции

// Приводит значение из HTTP (строка запроса / JSON) к типу поля отбора.
//
Функция ПривестиСыроеЗначениеПараметраОтбораКТипуПоля(ИмяТаблицы, ИмяПоля, СыроеЗначение, ТипПараметраСтрока, СпособСопоставления = Неопределено) Экспорт
	
	Если СыроеЗначение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ТипЗнч(СыроеЗначение) <> Тип("Строка") Тогда
		Возврат СыроеЗначение;
	КонецЕсли;
	
	ОТ = ПолучитьОписаниеТипаПоляТаблицы(ИмяТаблицы, ИмяПоля);
	Если ОТ.Типы().Количество() > 0 Тогда
		Возврат ЗначениеИзСтрокиПоОписаниюТиповИСпособу(ОТ, СыроеЗначение, СпособСопоставления);
	КонецЕсли;
	
	Возврат ПреобразоватьСтрокуПараметраПоТипуИзСтрокиНастроек(СыроеЗначение, ТипПараметраСтрока);
	
КонецФункции

// Сериализует значение, введённое в форме отбора (ссылка, дата, число и т.д.), в строку для «Значение (фикс.)».
//
Функция СтрокаКонстантыОтбораДляСохранения(Значение) Экспорт
	
	Возврат ПредставлениеЗначенияДляСтрокиОтбора(Значение);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЭлементСпискаОбъектов(Массив, Мета)
	
	Стр = Новый Структура;
	Стр.Вставить("Имя", Мета.Имя);
	Стр.Вставить("Представление", Мета.Представление());
	Массив.Добавить(Стр);
	
КонецПроцедуры

Процедура СортироватьМассивСтруктурПоПредставлению(Массив)
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	Для Каждого Стр Из Массив Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Представление = Стр.Представление;
		НоваяСтрока.Имя = Стр.Имя;
	КонецЦикла;
	Таблица.Сортировать("Представление");
	Массив.Очистить();
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Массив.Добавить(Новый Структура("Имя, Представление", СтрокаТаблицы.Имя, СтрокаТаблицы.Представление));
	КонецЦикла;
	
КонецПроцедуры

Функция ЗначениеКлючаСтруктуры(Поддерживаемое, ИмяКлюча)
	
	Если ТипЗнч(Поддерживаемое) = Тип("Структура") Тогда
		Если Поддерживаемое.Свойство(ИмяКлюча) Тогда
			Возврат Поддерживаемое[ИмяКлюча];
		КонецЕсли;
	ИначеЕсли ТипЗнч(Поддерживаемое) = Тип("Соответствие") Тогда
		Возврат Поддерживаемое.Получить(ИмяКлюча);
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

Функция ОписаниеМетаданныхДляПолей(ПолноеИмяТаблицы)
	
	ОбъектМД = Метаданные.НайтиПоПолномуИмени(ПолноеИмяТаблицы);
	Если ОбъектМД <> Неопределено Тогда
		Возврат КоллекцияПолейДляОбъектаМетаданных(ОбъектМД, Ложь);
	КонецЕсли;
	
	Части = СтрРазделить(ПолноеИмяТаблицы, ".");
	Если Части.Количество() = 4 И ВРег(СокрЛП(Части[2])) = ВРег("ТабличнаяЧасть") Тогда
		Родитель = Метаданные.НайтиПоПолномуИмени(Части[0] + "." + Части[1]);
		Если Родитель <> Неопределено Тогда
			ТЧ = Родитель.ТабличныеЧасти.Найти(СокрЛП(Части[3]));
			Если ТЧ <> Неопределено Тогда
				Возврат КоллекцияПолейДляОбъектаМетаданных(ТЧ, Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция КоллекцияПолейДляОбъектаМетаданных(ОбъектМД, ЭтоТабличнаяЧасть)
	
	Поля = Новый Массив;
	ПолноеИмя = ОбъектМД.ПолноеИмя();
	
	Если ЭтоТабличнаяЧасть Тогда
		Для Каждого Рек Из ОбъектМД.Реквизиты Цикл
			ДобавитьОписаниеПоля(Поля, Рек.Имя, ПредставлениеЭлементаМД(Рек));
		КонецЦикла;
	ИначеЕсли СтрНачинаетсяС(ПолноеИмя, "Справочник.") Или СтрНачинаетсяС(ПолноеИмя, "Документ.") Тогда
		ДобавитьОписаниеПоля(Поля, "Ссылка", "Ссылка");
		Для Каждого Рек Из ОбъектМД.Реквизиты Цикл
			ДобавитьОписаниеПоля(Поля, Рек.Имя, ПредставлениеЭлементаМД(Рек));
		КонецЦикла;
	ИначеЕсли СтрНачинаетсяС(ПолноеИмя, "РегистрСведений.") Тогда
		Для Каждого Изм Из ОбъектМД.Измерения Цикл
			ДобавитьОписаниеПоля(Поля, Изм.Имя, ПредставлениеЭлементаМД(Изм));
		КонецЦикла;
		Для Каждого Рес Из ОбъектМД.Ресурсы Цикл
			ДобавитьОписаниеПоля(Поля, Рес.Имя, ПредставлениеЭлементаМД(Рес));
		КонецЦикла;
		Для Каждого Рек Из ОбъектМД.Реквизиты Цикл
			ДобавитьОписаниеПоля(Поля, Рек.Имя, ПредставлениеЭлементаМД(Рек));
		КонецЦикла;
	ИначеЕсли СтрНачинаетсяС(ПолноеИмя, "ПланВидовХарактеристик.") Тогда
		ДобавитьОписаниеПоля(Поля, "Ссылка", "Ссылка");
		Для Каждого Рек Из ОбъектМД.Реквизиты Цикл
			ДобавитьОписаниеПоля(Поля, Рек.Имя, ПредставлениеЭлементаМД(Рек));
		КонецЦикла;
	КонецЕсли;
	
	Возврат Новый Структура("Поля", Поля);
	
КонецФункции

Процедура ДобавитьОписаниеПоля(Поля, Имя, Представление)
	
	Стр = Новый Структура("Имя, Представление", Имя, Представление);
	Поля.Добавить(Стр);
	
КонецПроцедуры

Функция ПредставлениеЭлементаМД(ЭлементМД)
	
	Попытка
		Возврат ЭлементМД.Представление();
	Исключение
		Попытка
			Возврат Строка(ЭлементМД.Синоним);
		Исключение
			Возврат ЭлементМД.Имя;
		КонецПопытки;
	КонецПопытки;
	
КонецФункции

Функция СоответствиеПредставленийПолей(ПолноеИмяТаблицы)
	
	Результат = Новый Соответствие;
	Описание = ОписаниеМетаданныхДляПолей(ПолноеИмяТаблицы);
	Если Описание = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	Для Каждого Поле Из Описание.Поля Цикл
		Результат.Вставить(Поле.Имя, Поле.Представление);
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция JSONВЗначение(СтрокаJSON)
	
	Если Не ЗначениеЗаполнено(СтрокаJSON) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции

Функция ПредставлениеЗначенияДляСтрокиОтбора(Значение)
	
	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	ТипЗ = ТипЗнч(Значение);
	Мета = Метаданные.НайтиПоТипу(ТипЗ);
	Если Мета <> Неопределено Тогда
		ПИ = Мета.ПолноеИмя();
		Если СтрНачинаетсяС(ПИ, "Справочник.")
			Или СтрНачинаетсяС(ПИ, "Документ.")
			Или СтрНачинаетсяС(ПИ, "ПланВидовХарактеристик.")
			Или СтрНачинаетсяС(ПИ, "ПланСчетов.")
			Или СтрНачинаетсяС(ПИ, "ПланВидовРасчета.")
			Или СтрНачинаетсяС(ПИ, "БизнесПроцесс.")
			Или СтрНачинаетсяС(ПИ, "Задача.") Тогда
			Попытка
				Если Значение.Пустая() Тогда
					Возврат "";
				КонецЕсли;
				Предст = СокрЛП(Строка(Значение));
				Если ЗначениеЗаполнено(Предст) Тогда
					Возврат Предст;
				КонецЕсли;
			Исключение
			КонецПопытки;
			Попытка
				Возврат Строка(Значение.УникальныйИдентификатор());
			Исключение
				Возврат Строка(Значение);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Если ТипЗ = Тип("Дата") Тогда
		Попытка
			Возврат XMLСтрока(Значение);
		Исключение
			Возврат Строка(Значение);
		КонецПопытки;
	КонецЕсли;
	Если ТипЗ = Тип("Булево") Тогда
		Возврат ?(Значение, "Истина", "Ложь");
	КонецЕсли;
	Возврат Строка(Значение);
	
КонецФункции

Функция ОписаниеТипаПоляОбъектаМетаданных(ОбъектМД, ИмяПоля, ЭтоТабличнаяЧасть)
	
	ПолноеИмя = ОбъектМД.ПолноеИмя();
	
	Если ЭтоТабличнаяЧасть Тогда
		Рек = ОбъектМД.Реквизиты.Найти(ИмяПоля);
		Если Рек <> Неопределено Тогда
			Возврат Рек.Тип;
		КонецЕсли;
		Возврат Новый ОписаниеТипов;
	КонецЕсли;
	
	Если СтрНачинаетсяС(ПолноеИмя, "Справочник.") Тогда
		Если ВРег(ИмяПоля) = ВРег("Ссылка") Тогда
			Возврат Новый ОписаниеТипов(Тип("СправочникСсылка." + ОбъектМД.Имя));
		КонецЕсли;
		Рек = ОбъектМД.Реквизиты.Найти(ИмяПоля);
		Если Рек <> Неопределено Тогда
			Возврат Рек.Тип;
		КонецЕсли;
	ИначеЕсли СтрНачинаетсяС(ПолноеИмя, "Документ.") Тогда
		Если ВРег(ИмяПоля) = ВРег("Ссылка") Тогда
			Возврат Новый ОписаниеТипов(Тип("ДокументСсылка." + ОбъектМД.Имя));
		КонецЕсли;
		Рек = ОбъектМД.Реквизиты.Найти(ИмяПоля);
		Если Рек <> Неопределено Тогда
			Возврат Рек.Тип;
		КонецЕсли;
	ИначеЕсли СтрНачинаетсяС(ПолноеИмя, "РегистрСведений.") Тогда
		Для Каждого Изм Из ОбъектМД.Измерения Цикл
			Если Изм.Имя = ИмяПоля Тогда
				Возврат Изм.Тип;
			КонецЕсли;
		КонецЦикла;
		Для Каждого Рес Из ОбъектМД.Ресурсы Цикл
			Если Рес.Имя = ИмяПоля Тогда
				Возврат Рес.Тип;
			КонецЕсли;
		КонецЦикла;
		Для Каждого Рек Из ОбъектМД.Реквизиты Цикл
			Если Рек.Имя = ИмяПоля Тогда
				Возврат Рек.Тип;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли СтрНачинаетсяС(ПолноеИмя, "ПланВидовХарактеристик.") Тогда
		Если ВРег(ИмяПоля) = ВРег("Ссылка") Тогда
			Возврат Новый ОписаниеТипов(Тип("ПланВидовХарактеристикСсылка." + ОбъектМД.Имя));
		КонецЕсли;
		Рек = ОбъектМД.Реквизиты.Найти(ИмяПоля);
		Если Рек <> Неопределено Тогда
			Возврат Рек.Тип;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый ОписаниеТипов;
	
КонецФункции

Функция ЭтоСсылочныйТипМетаданных(ТипЗначения)
	
	Мета = Метаданные.НайтиПоТипу(ТипЗначения);
	Если Мета = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	ПИ = Мета.ПолноеИмя();
	Возврат СтрНачинаетсяС(ПИ, "Справочник.")
		Или СтрНачинаетсяС(ПИ, "Документ.")
		Или СтрНачинаетсяС(ПИ, "Перечисление.")
		Или СтрНачинаетсяС(ПИ, "ПланВидовХарактеристик.")
		Или СтрНачинаетсяС(ПИ, "ПланСчетов.")
		Или СтрНачинаетсяС(ПИ, "ПланВидовРасчета.")
		Или СтрНачинаетсяС(ПИ, "БизнесПроцесс.")
		Или СтрНачинаетсяС(ПИ, "Задача.");
	
КонецФункции

Функция СсылкаПоТипуИУникальномуИдентификатору(ТипСсылки, УИ)
	
	Мета = Метаданные.НайтиПоТипу(ТипСсылки);
	Если Мета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ПИ = Мета.ПолноеИмя();
	Попытка
		Если СтрНачинаетсяС(ПИ, "Справочник.") Тогда
			Возврат Справочники[Мета.Имя].ПолучитьСсылку(УИ);
		ИначеЕсли СтрНачинаетсяС(ПИ, "Документ.") Тогда
			Возврат Документы[Мета.Имя].ПолучитьСсылку(УИ);
		ИначеЕсли СтрНачинаетсяС(ПИ, "ПланВидовХарактеристик.") Тогда
			Возврат ПланыВидовХарактеристик[Мета.Имя].ПолучитьСсылку(УИ);
		ИначеЕсли СтрНачинаетсяС(ПИ, "ПланСчетов.") Тогда
			Возврат ПланыСчетов[Мета.Имя].ПолучитьСсылку(УИ);
		ИначеЕсли СтрНачинаетсяС(ПИ, "ПланВидовРасчета.") Тогда
			Возврат ПланыВидовРасчета[Мета.Имя].ПолучитьСсылку(УИ);
		ИначеЕсли СтрНачинаетсяС(ПИ, "БизнесПроцесс.") Тогда
			Возврат БизнесПроцессы[Мета.Имя].ПолучитьСсылку(УИ);
		ИначеЕсли СтрНачинаетсяС(ПИ, "Задача.") Тогда
			Возврат Задачи[Мета.Имя].ПолучитьСсылку(УИ);
		КонецЕсли;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	Возврат Неопределено;
	
КонецФункции

Функция ЗначениеИзСтрокиПоОписаниюТиповКомпозитный(ОписаниеТипов, Стр)
	
	Типы = ОписаниеТипов.Типы();
	Если СтрокаПохожаНаУникальныйИдентификатор(Стр) Тогда
		Для Каждого ОдинТип Из Типы Цикл
			Если ЭтоСсылочныйТипМетаданных(ОдинТип) Тогда
				Попытка
					УИ = Новый УникальныйИдентификатор(Стр);
					Ссылка = СсылкаПоТипуИУникальномуИдентификатору(ОдинТип, УИ);
					Если Ссылка <> Неопределено Тогда
						Возврат Ссылка;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Для Каждого ОдинТип Из Типы Цикл
		Если ОдинТип = Тип("Число") Тогда
			Попытка
				Возврат Число(Стр);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	Для Каждого ОдинТип Из Типы Цикл
		Если ОдинТип = Тип("Булево") Тогда
			НС = ВРег(Стр);
			Если НС = "ИСТИНА" Или НС = "TRUE" Или НС = "ДА" Или НС = "1" Тогда
				Возврат Истина;
			ИначеЕсли НС = "ЛОЖЬ" Или НС = "FALSE" Или НС = "НЕТ" Или НС = "0" Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Для Каждого ОдинТип Из Типы Цикл
		Если ОдинТип = Тип("Дата") Тогда
			Попытка
				Возврат XMLЗначение(Тип("Дата"), Стр);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	Для Каждого ОдинТип Из Типы Цикл
		Если ОдинТип = Тип("Строка") Тогда
			Возврат Стр;
		КонецЕсли;
	КонецЦикла;
	Возврат Стр;
	
КонецФункции

Функция СпособСопоставленияОтбораНормализовать(СпособСопоставления)
	
	Если СпособСопоставления = Неопределено Или Не ЗначениеЗаполнено(СпособСопоставления) Тогда
		Возврат Перечисления.МС_СпособСопоставленияПараметраОтбора.Авто;
	КонецЕсли;
	Возврат СпособСопоставления;
	
КонецФункции

Функция СправочникСсылкаИзСтрокиПоСпособу(ИмяСправочника, Знач Стр, Способ)
	
	Менеджер = Справочники[ИмяСправочника];
	ТУИ = Тип("СправочникСсылка." + ИмяСправочника);
	ПоУИ = Перечисления.МС_СпособСопоставленияПараметраОтбора.Идентификатор;
	ПоКоду = Перечисления.МС_СпособСопоставленияПараметраОтбора.Код;
	ПоНаим = Перечисления.МС_СпособСопоставленияПараметраОтбора.Наименование;
	
	Если Способ = ПоУИ Тогда
		Попытка
			УИ = Новый УникальныйИдентификатор(Стр);
			Возврат СсылкаПоТипуИУникальномуИдентификатору(ТУИ, УИ);
		Исключение
			Возврат Менеджер.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
	Если Способ = ПоКоду Тогда
		Попытка
			Возврат Менеджер.НайтиПоКоду(Стр, Истина);
		Исключение
			Возврат Менеджер.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
	Если Способ = ПоНаим Тогда
		Попытка
			Возврат Менеджер.НайтиПоНаименованию(Стр, Истина);
		Исключение
			Возврат Менеджер.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
	Попытка
		УИ = Новый УникальныйИдентификатор(Стр);
		Ссылка = СсылкаПоТипуИУникальномуИдентификатору(ТУИ, УИ);
		Если Ссылка <> Неопределено Тогда
			Возврат Ссылка;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		СсылкаКод = Менеджер.НайтиПоКоду(Стр, Истина);
		Если Не СсылкаКод.Пустая() Тогда
			Возврат СсылкаКод;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Возврат Менеджер.НайтиПоНаименованию(Стр, Истина);
	Исключение
		Возврат Менеджер.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

Функция ДокументСсылкаИзСтрокиПоСпособу(ИмяДокумента, Знач Стр, Способ)
	
	Менеджер = Документы[ИмяДокумента];
	ТУИ = Тип("ДокументСсылка." + ИмяДокумента);
	ПоУИ = Перечисления.МС_СпособСопоставленияПараметраОтбора.Идентификатор;
	ПоКоду = Перечисления.МС_СпособСопоставленияПараметраОтбора.Код;
	ПоНаим = Перечисления.МС_СпособСопоставленияПараметраОтбора.Наименование;
	
	Если Способ = ПоУИ Тогда
		Попытка
			УИ = Новый УникальныйИдентификатор(Стр);
			Возврат СсылкаПоТипуИУникальномуИдентификатору(ТУИ, УИ);
		Исключение
			Возврат Менеджер.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
	Если Способ = ПоКоду Или Способ = ПоНаим Тогда
		Попытка
			Возврат Менеджер.НайтиПоНомеру(Стр, ТекущаяДатаСеанса());
		Исключение
			Возврат Менеджер.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
	Попытка
		УИ = Новый УникальныйИдентификатор(Стр);
		Ссылка = СсылкаПоТипуИУникальномуИдентификатору(ТУИ, УИ);
		Если Ссылка <> Неопределено Тогда
			Возврат Ссылка;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Возврат Менеджер.НайтиПоНомеру(Стр, ТекущаяДатаСеанса());
	Исключение
		Возврат Менеджер.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

Функция ПланВидовХарактеристикСсылкаИзСтрокиПоСпособу(ИмяОбъекта, Знач Стр, Способ)
	
	Менеджер = ПланыВидовХарактеристик[ИмяОбъекта];
	ТУИ = Тип("ПланВидовХарактеристикСсылка." + ИмяОбъекта);
	ПоУИ = Перечисления.МС_СпособСопоставленияПараметраОтбора.Идентификатор;
	ПоКоду = Перечисления.МС_СпособСопоставленияПараметраОтбора.Код;
	ПоНаим = Перечисления.МС_СпособСопоставленияПараметраОтбора.Наименование;
	
	Если Способ = ПоУИ Тогда
		Попытка
			УИ = Новый УникальныйИдентификатор(Стр);
			Возврат СсылкаПоТипуИУникальномуИдентификатору(ТУИ, УИ);
		Исключение
			Возврат Менеджер.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
	Если Способ = ПоКоду Тогда
		Попытка
			Возврат Менеджер.НайтиПоКоду(Стр, Истина);
		Исключение
			Возврат Менеджер.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
	Если Способ = ПоНаим Тогда
		Попытка
			Возврат Менеджер.НайтиПоНаименованию(Стр, Истина);
		Исключение
			Возврат Менеджер.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
	Попытка
		УИ = Новый УникальныйИдентификатор(Стр);
		Ссылка = СсылкаПоТипуИУникальномуИдентификатору(ТУИ, УИ);
		Если Ссылка <> Неопределено Тогда
			Возврат Ссылка;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		СсылкаКод = Менеджер.НайтиПоКоду(Стр, Истина);
		Если Не СсылкаКод.Пустая() Тогда
			Возврат СсылкаКод;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Возврат Менеджер.НайтиПоНаименованию(Стр, Истина);
	Исключение
		Возврат Менеджер.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

Функция ПланСчетовСсылкаИзСтрокиПоСпособу(ИмяПлана, Знач Стр, Способ)
	
	Менеджер = ПланыСчетов[ИмяПлана];
	ТУИ = Тип("ПланСчетовСсылка." + ИмяПлана);
	ПоУИ = Перечисления.МС_СпособСопоставленияПараметраОтбора.Идентификатор;
	ПоКоду = Перечисления.МС_СпособСопоставленияПараметраОтбора.Код;
	ПоНаим = Перечисления.МС_СпособСопоставленияПараметраОтбора.Наименование;
	
	Если Способ = ПоУИ Тогда
		Попытка
			УИ = Новый УникальныйИдентификатор(Стр);
			Возврат СсылкаПоТипуИУникальномуИдентификатору(ТУИ, УИ);
		Исключение
			Возврат Менеджер.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
	Если Способ = ПоКоду Или Способ = ПоНаим Тогда
		Попытка
			Возврат Менеджер.НайтиПоКоду(Стр);
		Исключение
			Возврат Менеджер.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
	Попытка
		УИ = Новый УникальныйИдентификатор(Стр);
		Ссылка = СсылкаПоТипуИУникальномуИдентификатору(ТУИ, УИ);
		Если Ссылка <> Неопределено Тогда
			Возврат Ссылка;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Возврат Менеджер.НайтиПоКоду(Стр);
	Исключение
		Возврат Менеджер.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

Функция ЗначениеИзСтрокиДляОдногоТипа(ОдинТип, Стр)
	
	Возврат ЗначениеИзСтрокиДляОдногоТипаССпособом(ОдинТип, Стр, Неопределено);
	
КонецФункции

Функция ЗначениеИзСтрокиДляОдногоТипаССпособом(ОдинТип, Стр, СпособСопоставления)
	
	Способ = СпособСопоставленияОтбораНормализовать(СпособСопоставления);
	
	Если ОдинТип = Тип("Строка") Тогда
		Возврат Стр;
	ИначеЕсли ОдинТип = Тип("Число") Тогда
		Попытка
			Возврат Число(Стр);
		Исключение
			Возврат 0;
		КонецПопытки;
	ИначеЕсли ОдинТип = Тип("Булево") Тогда
		НС = ВРег(Стр);
		Если НС = "ИСТИНА" Или НС = "TRUE" Или НС = "ДА" Или НС = "1" Тогда
			Возврат Истина;
		ИначеЕсли НС = "ЛОЖЬ" Или НС = "FALSE" Или НС = "НЕТ" Или НС = "0" Тогда
			Возврат Ложь;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ОдинТип = Тип("Дата") Тогда
		Попытка
			Возврат XMLЗначение(Тип("Дата"), Стр);
		Исключение
			Возврат '00010101';
		КонецПопытки;
	ИначеЕсли ОдинТип = Тип("УникальныйИдентификатор") Тогда
		Попытка
			Возврат Новый УникальныйИдентификатор(Стр);
		Исключение
			Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
		КонецПопытки;
	ИначеЕсли ЭтоСсылочныйТипМетаданных(ОдинТип) Тогда
		Мета = Метаданные.НайтиПоТипу(ОдинТип);
		Если Мета = Неопределено Тогда
			Возврат Стр;
		КонецЕсли;
		ПИ = Мета.ПолноеИмя();
		
		Если СтрНачинаетсяС(ПИ, "Перечисление.") Тогда
			Для Каждого МетаЗнач Из Мета.ЗначенияПеречисления Цикл
				Если ВРег(МетаЗнач.Имя) = ВРег(Стр) Тогда
					Возврат Перечисления[Мета.Имя][МетаЗнач.Имя];
				КонецЕсли;
			КонецЦикла;
			Возврат Неопределено;
		КонецЕсли;
		
		Если СтрНачинаетсяС(ПИ, "Справочник.") Тогда
			Возврат СправочникСсылкаИзСтрокиПоСпособу(Мета.Имя, Стр, Способ);
		КонецЕсли;
		
		Если СтрНачинаетсяС(ПИ, "Документ.") Тогда
			Возврат ДокументСсылкаИзСтрокиПоСпособу(Мета.Имя, Стр, Способ);
		КонецЕсли;
		
		Если СтрНачинаетсяС(ПИ, "ПланВидовХарактеристик.") Тогда
			Возврат ПланВидовХарактеристикСсылкаИзСтрокиПоСпособу(Мета.Имя, Стр, Способ);
		КонецЕсли;
		
		Если СтрНачинаетсяС(ПИ, "ПланСчетов.") Тогда
			Возврат ПланСчетовСсылкаИзСтрокиПоСпособу(Мета.Имя, Стр, Способ);
		КонецЕсли;
		
		Если Способ = Перечисления.МС_СпособСопоставленияПараметраОтбора.Идентификатор
			Или Способ = Перечисления.МС_СпособСопоставленияПараметраОтбора.Авто Тогда
			Попытка
				УИ = Новый УникальныйИдентификатор(Стр);
				Ссылка = СсылкаПоТипуИУникальномуИдентификатору(ОдинТип, УИ);
				Если Ссылка <> Неопределено Тогда
					Возврат Ссылка;
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Возврат Стр;
	
КонецФункции

Функция СтрокаПохожаНаУникальныйИдентификатор(Стр)
	
	Если СтрДлина(Стр) < 36 Тогда
		Возврат Ложь;
	КонецЕсли;
	Попытка
		УИ = Новый УникальныйИдентификатор(Стр);
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция ПреобразоватьСтрокуПараметраПоТипуИзСтрокиНастроек(Знач СтрокаЗначения, ТипПараметраСтрока)
	
	Если Не ЗначениеЗаполнено(СтрокаЗначения) Тогда
		Возврат "";
	КонецЕсли;
	
	ТипС = ?(ЗначениеЗаполнено(ТипПараметраСтрока), ВРег(СокрЛП(Строка(ТипПараметраСтрока))), "");
	
	Если ТипС = "ЧИСЛО" Или ТипС = "NUMBER" Тогда
		Попытка
			Возврат Число(СтрокаЗначения);
		Исключение
			Возврат 0;
		КонецПопытки;
	ИначеЕсли ТипС = "БУЛЕВО" Или ТипС = "BOOLEAN" Тогда
		НС = ВРег(СокрЛП(Строка(СтрокаЗначения)));
		Возврат НС = "ИСТИНА" Или НС = "TRUE" Или НС = "ДА" Или НС = "1";
	ИначеЕсли ТипС = "ДАТА" Или ТипС = "DATE" Тогда
		Попытка
			Возврат XMLЗначение(Тип("Дата"), СтрокаЗначения);
		Исключение
			Возврат СтрокаЗначения;
		КонецПопытки;
	Иначе
		Возврат СтрокаЗначения;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
